---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudDiameter
source: html/393957a6-6d98-039e-4acd-9897d782b311.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemShearstudDiameter { get; }
```